
## Terraform plan for environment: `prep`

**Commit:** 4a55b22cf03f8954b1a5358db8e5ee887843d319


**API version:** 4a55b22cf0
**CLI version:** 4a55b22cf0
**Selfserve version:** 0d8b7f1758
**Internal version:** 0d8b7f1758
**search version:** release-v5.19.0

### Plan summary

`19 to add, 100 to change, 4 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_target_group.this["pdf-converter"]
module.service.module.ecs_cluster["pdf-converter"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["pdf-converter"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["pdf-converter"].aws_ecs_service.this[0]
module.service.module.ecs_service["pdf-converter"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role.tasks[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-prep-batch-failure-email-dvsa.tss-support+prep_olcs_jobs"]
module.service.module.ecs_service["pdf-converter"].module.container_definition["pdf-converter"].aws_cloudwatch_log_group.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.aws_lb_listener_rule.this["api"]
module.service.aws_lb_listener_rule.this["internal"]
module.service.aws_lb_listener_rule.this["selfserve"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_caller_identity.current
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["api"].data.aws_partition.current
module.service.module.ecs_service["api"].data.aws_region.current
module.service.module.ecs_service["internal"].data.aws_caller_identity.current
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["internal"].data.aws_partition.current
module.service.module.ecs_service["internal"].data.aws_region.current
module.service.module.ecs_service["pdf-converter"].data.aws_caller_identity.current
module.service.module.ecs_service["pdf-converter"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["pdf-converter"].data.aws_partition.current
module.service.module.ecs_service["pdf-converter"].data.aws_region.current
module.service.module.ecs_service["selfserve"].data.aws_caller_identity.current
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_partition.current
module.service.module.ecs_service["selfserve"].data.aws_region.current
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
module.service.module.ecs_service["api"].module.container_definition["api"].data.aws_region.current
module.service.module.ecs_service["internal"].module.container_definition["internal"].data.aws_region.current
module.service.module.ecs_service["pdf-converter"].module.container_definition["pdf-converter"].data.aws_region.current
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].data.aws_region.current
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.batch.aws_batch_job_queue.this["default"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer"]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "1274998038914408128" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v5.24.30-rc26" -> "4a55b22cf0"
          ~ "deployed_assets_version"      = "release-v5.24.30-rc26" -> "56d70a9b57"
          ~ "deployed_cli_image_tag"       = "release-v5.24.30-rc26" -> "4a55b22cf0"
          ~ "deployed_internal_image_tag"  = "release-v5.24.30-rc26" -> "0d8b7f1758"
          ~ "deployed_selfserve_image_tag" = "release-v5.24.30-rc26" -> "0d8b7f1758"
        }
    }

  # module.service.aws_lb_listener_rule.this["api"] will be destroyed
  # (because key ["api"] is not in for_each map)
  - resource "aws_lb_listener_rule" "this" {
      - arn          = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/bd0e2df83e33ab62/43b0e0cbe74cf274" -> null
      - id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/bd0e2df83e33ab62/43b0e0cbe74cf274" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/bd0e2df83e33ab62" -> null
      - priority     = 10 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "Environment" = "prep"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/APPPP-OLCS-PRI-API-TG/deea73f278560ae1" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "api.*",
                ] -> null
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["internal"] will be destroyed
  # (because key ["internal"] is not in for_each map)
  - resource "aws_lb_listener_rule" "this" {
      - arn          = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03/4c00d93ceff60665/32842c232cf9628d" -> null
      - id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03/4c00d93ceff60665/32842c232cf9628d" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03/4c00d93ceff60665" -> null
      - priority     = 10 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "Environment" = "prep"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/APPPP-OLCS-PRI-IUWEB-TG/afebf5ce87686dc6" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "iuweb.*",
                ] -> null
            }
        }
    }

  # module.service.aws_lb_listener_rule.this["selfserve"] will be destroyed
  # (because key ["selfserve"] is not in for_each map)
  - resource "aws_lb_listener_rule" "this" {
      - arn          = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be/fd41ce8376741e70/5bdff854bef25491" -> null
      - id           = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener-rule/app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be/fd41ce8376741e70/5bdff854bef25491" -> null
      - listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be/fd41ce8376741e70" -> null
      - priority     = 10 -> null
      - tags         = {} -> null
      - tags_all     = {
          - "Environment" = "prep"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null

      - action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:targetgroup/APPPP-OLCS-PRI-SSWEB-TG/2a1b1492b8351479" -> null
          - type             = "forward" -> null
        }

      - condition {
          - host_header {
              - values = [
                  - "ssweb.*",
                ] -> null
            }
        }
    }

  # module.service.aws_lb_target_group.this["pdf-converter"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "vol-app-prep-pdf-converter-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-9b62fffe"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200-499"
          + path                = "/healthcheck"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:41"
        name                       = "vol-app-prep-cancel-unsubmitted-bilateral"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:41"
        name                       = "vol-app-prep-ch-vs-olcs-diffs"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:41"
        name                       = "vol-app-prep-clean-up-variations"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:41"
        name                       = "vol-app-prep-close-expired-windows"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:41"
        name                       = "vol-app-prep-cns"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:41"
        name                       = "vol-app-prep-company-profile-dlq"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:41"
        name                       = "vol-app-prep-create-psv-licence-surrender-task"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:41"
        name                       = "vol-app-prep-data-retention-delete"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:41"
        name                       = "vol-app-prep-data-retention-populate"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:41"
        name                       = "vol-app-prep-data-retention-postcheck"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:41"
        name                       = "vol-app-prep-data-retention-precheck"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:41"
        name                       = "vol-app-prep-database-maintenance"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:41"
        name                       = "vol-app-prep-digital-continuation-reminders"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:41"
        name                       = "vol-app-prep-duplicate-vehicle-warning"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:41"
        name                       = "vol-app-prep-enqueue-ch-compare"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:41"
        name                       = "vol-app-prep-expire-bus-registration"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:41"
        name                       = "vol-app-prep-flag-urgent-tasks"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:44" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.30-rc26"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "4a55b22cf0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:44"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 44 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:41"
        name                       = "vol-app-prep-import-users-from-csv"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:41"
        name                       = "vol-app-prep-inspection-request-email"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:41"
        name                       = "vol-app-prep-interim-end-date-enforcement"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:41"
        name                       = "vol-app-prep-international-goods-export"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:41"
        name                       = "vol-app-prep-last-tm-letter"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:41"
        name                       = "vol-app-prep-licence-status-rules"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:41"
        name                       = "vol-app-prep-mark-expired-permits"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:44" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.30-rc26"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "4a55b22cf0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:44"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 44 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:44" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.30-rc26"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "4a55b22cf0"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:44"
        name                       = "vol-app-prep-populate-anondb"
      ~ revision                   = 44 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-cl:41"
        name                       = "vol-app-prep-process-cl"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-company-profile:41"
        name                       = "vol-app-prep-process-company-profile"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-inbox:41"
        name                       = "vol-app-prep-process-inbox"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.30-rc26" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "4a55b22cf0"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.30-rc26" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:4a55b22cf0"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency:41"
        name                       = "vol-app-prep-process-insolvency"
      ~ revision                   = 41 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-process-insolvency-dlq:41" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment  ... (truncated, see full plan in the workflow run logs)
```

</details>